modules/api/models/FirmCulturesTotal.php

SELECT SUM((firmCulturesTotal.weight*firmCulturesTotal.square)) FROM `firms` LEFT JOIN `firmCultures` `firmCulturesTotal` ON firmCulturesTotal.firmUID = firms.uid AND firmCulturesTotal.year = 2018
SELECT SUM(firmCulturesTotal.square) FROM `firms` LEFT JOIN `firmCultures` `firmCulturesTotal` ON firmCulturesTotal.firmUID = firms.uid AND firmCulturesTotal.year = 2018
---
    public function existJoin($join){
        if ($this->getQuery()->join){
            foreach ($this->getQuery()->join as $j){