modules/api/models/RegionCulturesFinder.php

    public static function findOne($data){
        $inst = static::getInstance($data);
        return \app\models\RegionCultures::find()->where(['cultureUID'=>$inst->cultureUID,'regionUID'=>$inst->regionUID])->one();
---
SELECT * FROM `regionCultures` WHERE (`cultureUID`='3314c918-ebc0-11e7-8660-60a44cafafcb') AND (`regionUID`='a6rK8Gkk-9F4Q-eh34-H2fS-EQ58fE2ntBfh')