modules/api/controllers/FirmsController.php

SELECT * FROM `contacts`
SELECT * FROM `culture`
SELECT * FROM `elevators`
SELECT * FROM `points`
---
    public function actionIndex()
    {



        $this->filter(FirmsFilter::className());


        $totalInstance = new FirmCulturesTotal($this->getQuery());
        if ($this->getRequestData('selectedIds')){
            //dump($totalInstance->getQuery()->createCommand()->getRawSql());
            $totalInstance->getQuery()->andFilterWhere(['firms.id'=>$this->getRequestData('selectedIds')]);
           // dump($totalInstance->getQuery()->createCommand()->getRawSql(),1);
        }
        $this->getQuery()
           //  ->addGroupBy('firms.id')
              // ->union()
            ->addOrderBy(['firms.id' => SORT_DESC]);
        $this->responseExtraData = [
            'contacts' => Contacts::find()->all(),
            'regions' => Regions::find()->with(['points'])->all(),
            'posts' => Posts::findAll(),
            'cultures' => Culture::find()->all(),
            'elevators' => Elevators::find()->all(),
            'points' => Points::find()->all(),
            'distributionStatuses' => Firms::distributionStatuses(),
            'weightTotal' => $totalInstance->weight(),
            'squareTotal' => $totalInstance->square()
//            'weightTotal' => 0,
//            'squareTotal' => 0

        ];