modules/api/controllers/RegionsController.php

SELECT * FROM `culture`
---
    public function actionYield(){
        $this->activeIndex();
        $cultures = Cultures::find()->all();