models/Firms.php

INSERT INTO `contacts` (`name`, `phone`, `email`, `firmUID`, `main`) VALUES ('СУПРЯГА МИКОЛА МИКОЛАЙОВИЧ', '+380988858021', 'diastan@ukr.net', 'kN9dE5a2-F5SA-NrG2-heb2-TYd4GadTifN3', 0)
DELETE FROM `contacts` WHERE `firmUID`='Qk7rnZR5-DZkE-fZdD-tQS2-fRsE92iDFK2a'
INSERT INTO `contacts` (`firmUID`, `name`, `postID`, `phone`, `email`, `main`) VALUES ('Qk7rnZR5-DZkE-fZdD-tQS2-fRsE92iDFK2a', 'ЮРЕСКУЛ СЕРГІЙ ПАВЛОВИЧ Главный контакт', NULL, '+380484937575', '', 1)
---
    public function saveContacts(){
        if ($this->saveContacts === null)
            return;
        Contacts::deleteAll(['firmUID'=>$this->uid]);
        if ($this->saveContacts && is_array($this->saveContacts)){
            foreach ($this->saveContacts as $contactInfo){

INSERT INTO `firmCultures` (`firmUID`, `square`, `weight`, `year`, `cultureUID`) VALUES ('kN9dE5a2-F5SA-NrG2-heb2-TYd4GadTifN3', 463, 2778, 2018, '48f9e143-f6ca-11e7-aa53-6466b304e311')
DELETE FROM `firmCultures` WHERE `firmUID`='kN9dE5a2-F5SA-NrG2-heb2-TYd4GadTifN3'
---
    public function saveCultures($delete=true){
        if ($this->saveCultures === null)
            return;
        if ($delete){
            FirmCultures::deleteAll(['firmUID' => $this->uid]);

INSERT INTO `firmDistances` (`distance`, `pointUID`, `firmUID`) VALUES (32, 'SkFnrSf4-GhNt-DKk4-yEA7-3eaHEQQR8RYa', 'kN9dE5a2-F5SA-NrG2-heb2-TYd4GadTifN3')
DELETE FROM `firmDistances` WHERE `firmUID`='Qk7rnZR5-DZkE-fZdD-tQS2-fRsE92iDFK2a'
INSERT INTO `firmDistances` (`firmUID`, `pointUID`, `distance`) VALUES ('Qk7rnZR5-DZkE-fZdD-tQS2-fRsE92iDFK2a', 'SkFnrSf4-GhNt-DKk4-yEA7-3eaHEQQR8RYa', 75)
---
    public function saveDistances(){

        if ($this->saveDistances === null)
            return;

        FirmDistances::deleteAll(['firmUID'=>$this->uid]);
        if ($this->saveDistances && is_array($this->saveDistances)){
            foreach ($this->saveDistances as $item){