models/RailwayTransit.php

    public static function extraDataToSave()
    {
        return [
            'contracts' => Contracts::find()->all(),
            'cultures' => Culture::find()->all(),
            'stations' => Stations::find()->asArray()->all(),
            'firmsRT' => RTFirms::find()->asArray()->all(),
            'ownershipWagons' => static::ownershipWagons(),
            'statuses' => static::statuses(),
            'statusIdNew' => static::STATUS_ID_NEW,
            'statusIdCompleted' => static::STATUS_ID_COMPLETED,
            'classes' => static::classes(),
            'types' => static::types()
        ];
---
SELECT * FROM `contracts`
SELECT * FROM `culture`
SELECT * FROM `stations`
SELECT * FROM `RTFirms`