models/Users.php

    public function afterSave($insert, $changedAttributes){
        if ($this->perm && is_array($this->perm)){
            Yii::$app->authManager->db->createCommand()
                ->delete(Yii::$app->authManager->assignmentTable, ['user_id' => $this->id])
                ->execute();
            foreach ($this->perm as $item) {
                $roleObj = Yii::$app->authManager->createRole($item);
---
DELETE FROM `auth_assignment` WHERE `user_id`=34
INSERT INTO `auth_assignment` (`user_id`, `item_name`, `created_at`) VALUES ('34', 'firms', 1542877253)

    public static function findIdentityByAccessToken($token, $type = null)
    {
        // die('45tg4545t');

        return static::findOne(['token' => $token]);
---
SELECT * FROM `users` WHERE `token`='VdrJLgda4gV5K424ORpxK4oQwlCa1h7d_token'

    public static function findIdentityByPhone($phone)
    {
        return static::findOne(['phone' => $phone]);
---
SELECT * FROM `users` WHERE `phone`=''